<<template>
    <div class="login_container">
        <el-dialog v-model="userStore.visiable" title="用户登录" ref="dialog">
            <el-row>
                <!-- 左侧 -->
                <el-col :span="12">
                    <div class="login" v-show="scene == 0">
                        <el-form :model="loginParm" :rules="rule" ref="form">
                            <el-form-item prop="phone">
                                <el-input placeholder="请输入手机号" :prefix-icon="User" v-model="loginParm.phone"></el-input>
                            </el-form-item>
                            <el-form-item prop="code">
                                <el-input placeholder="请输入你的验证码" :prefix-icon="Lock"
                                    v-model="loginParm.code"></el-input>
                            </el-form-item>
                            <el-form-item>
                                <el-button :disabled="!isPhone || flag ? true : false" @click="getCode">
                                    <CounteDown v-if="flag" :flag="flag" @getFlag="getFlag" />
                                    <span v-else>获取验证码</span>
                                </el-button>
                            </el-form-item>
                        </el-form>
                        <el-button style="width: 90%;" type="primary" size="default" @click="Login"
                            :disabled="!isPhone || loginParm.code.length < 6 ? true : false">用户登录</el-button>
                        <div class="bottom" @click="changeScene">
                            <p>微信扫码登陆</p>
                            <svg t="1713256246243" class="icon" viewBox="0 0 1024 1024" version="1.1"
                                xmlns="http://www.w3.org/2000/svg" p-id="5485" width="32" height="32">
                                <path
                                    d="M337.387283 341.82659c-17.757225 0-35.514451 11.83815-35.514451 29.595375s17.757225 29.595376 35.514451 29.595376 29.595376-11.83815 29.595376-29.595376c0-18.49711-11.83815-29.595376-29.595376-29.595375zM577.849711 513.479769c-11.83815 0-22.936416 12.578035-22.936416 23.6763 0 12.578035 11.83815 23.676301 22.936416 23.676301 17.757225 0 29.595376-11.83815 29.595376-23.676301s-11.83815-23.676301-29.595376-23.6763zM501.641618 401.017341c17.757225 0 29.595376-12.578035 29.595376-29.595376 0-17.757225-11.83815-29.595376-29.595376-29.595375s-35.514451 11.83815-35.51445 29.595375 17.757225 29.595376 35.51445 29.595376zM706.589595 513.479769c-11.83815 0-22.936416 12.578035-22.936416 23.6763 0 12.578035 11.83815 23.676301 22.936416 23.676301 17.757225 0 29.595376-11.83815 29.595376-23.676301s-11.83815-23.676301-29.595376-23.6763z"
                                    fill="#28C445" p-id="5486"></path>
                                <path
                                    d="M510.520231 2.959538C228.624277 2.959538 0 231.583815 0 513.479769s228.624277 510.520231 510.520231 510.520231 510.520231-228.624277 510.520231-510.520231-228.624277-510.520231-510.520231-510.520231zM413.595376 644.439306c-29.595376 0-53.271676-5.919075-81.387284-12.578034l-81.387283 41.433526 22.936416-71.768786c-58.450867-41.433526-93.965318-95.445087-93.965317-159.815029 0-113.202312 105.803468-201.988439 233.803468-201.98844 114.682081 0 216.046243 71.028902 236.023121 166.473989-7.398844-0.739884-14.797688-1.479769-22.196532-1.479769-110.982659 1.479769-198.289017 85.086705-198.289017 188.67052 0 17.017341 2.959538 33.294798 7.398844 49.572255-7.398844 0.739884-15.537572 1.479769-22.936416 1.479768z m346.265896 82.867052l17.757225 59.190752-63.630058-35.514451c-22.936416 5.919075-46.612717 11.83815-70.289017 11.83815-111.722543 0-199.768786-76.947977-199.768786-172.393063-0.739884-94.705202 87.306358-171.653179 198.289017-171.65318 105.803468 0 199.028902 77.687861 199.028902 172.393064 0 53.271676-34.774566 100.624277-81.387283 136.138728z"
                                    fill="#28C445" p-id="5487"></path>
                            </svg>
                        </div>
                    </div>
                    <!-- 点击微信图标和字符切换场景 -->
                    <div class="webchat" v-show="scene == 1">
                        <div class="phone" @click="handler">
                            <div id="login_container"></div>
                        <p>手机短信验证码登录</p>
                        <svg t="1713257181650" class="icon" viewBox="0 0 1024 1024" version="1.1"
                            xmlns="http://www.w3.org/2000/svg" p-id="4284" width="16" height="16">
                            <path
                                d="M664.250054 368.541681c10.015098 0 19.892049 0.732687 29.67281 1.795902-26.647917-122.810047-159.358451-214.077703-310.826188-214.077703-169.353083 0-308.085774 114.232694-308.085774 259.274068 0 83.708494 46.165436 152.460344 123.281791 205.78483l-30.80868 91.730191 107.688651-53.455469c38.558178 7.53665 69.459978 15.308661 107.924012 15.308661 9.66308 0 19.230993-0.470721 28.752858-1.225921-6.025227-20.36584-9.521864-41.723264-9.521864-63.862493C402.328693 476.632491 517.908058 368.541681 664.250054 368.541681zM498.62897 285.87389c23.200398 0 38.557154 15.120372 38.557154 38.061874 0 22.846334-15.356756 38.156018-38.557154 38.156018-23.107277 0-46.260603-15.309684-46.260603-38.156018C452.368366 300.994262 475.522716 285.87389 498.62897 285.87389zM283.016307 362.090758c-23.107277 0-46.402843-15.309684-46.402843-38.156018 0-22.941502 23.295566-38.061874 46.402843-38.061874 23.081695 0 38.46301 15.120372 38.46301 38.061874C321.479317 346.782098 306.098002 362.090758 283.016307 362.090758zM945.448458 606.151333c0-121.888048-123.258255-221.236753-261.683954-221.236753-146.57838 0-262.015505 99.348706-262.015505 221.236753 0 122.06508 115.437126 221.200938 262.015505 221.200938 30.66644 0 61.617359-7.609305 92.423993-15.262612l84.513836 45.786813-23.178909-76.17082C899.379213 735.776599 945.448458 674.90216 945.448458 606.151333zM598.803483 567.994292c-15.332197 0-30.807656-15.096836-30.807656-30.501688 0-15.190981 15.47546-30.477129 30.807656-30.477129 23.295566 0 38.558178 15.286148 38.558178 30.477129C637.361661 552.897456 622.099049 567.994292 598.803483 567.994292zM768.25071 567.994292c-15.213493 0-30.594809-15.096836-30.594809-30.501688 0-15.190981 15.381315-30.477129 30.594809-30.477129 23.107277 0 38.558178 15.286148 38.558178 30.477129C806.808888 552.897456 791.357987 567.994292 768.25071 567.994292z"
                                fill="#5D5D5D" p-id="4285"></path>
                        </svg>
                        </div>
                    </div>
                </el-col>
                <!-- 右侧 -->
                <el-col :span="12">
                    <div class="leftcontent">
                        <div class="top">
                            <div class="item">
                                <img src="../../assets/images/code_app.png" alt="#" />
                                <svg t="1713257181650" class="icon" viewBox="0 0 1024 1024" version="1.1"
                                    xmlns="http://www.w3.org/2000/svg" p-id="4284" width="16" height="16">
                                    <path
                                        d="M664.250054 368.541681c10.015098 0 19.892049 0.732687 29.67281 1.795902-26.647917-122.810047-159.358451-214.077703-310.826188-214.077703-169.353083 0-308.085774 114.232694-308.085774 259.274068 0 83.708494 46.165436 152.460344 123.281791 205.78483l-30.80868 91.730191 107.688651-53.455469c38.558178 7.53665 69.459978 15.308661 107.924012 15.308661 9.66308 0 19.230993-0.470721 28.752858-1.225921-6.025227-20.36584-9.521864-41.723264-9.521864-63.862493C402.328693 476.632491 517.908058 368.541681 664.250054 368.541681zM498.62897 285.87389c23.200398 0 38.557154 15.120372 38.557154 38.061874 0 22.846334-15.356756 38.156018-38.557154 38.156018-23.107277 0-46.260603-15.309684-46.260603-38.156018C452.368366 300.994262 475.522716 285.87389 498.62897 285.87389zM283.016307 362.090758c-23.107277 0-46.402843-15.309684-46.402843-38.156018 0-22.941502 23.295566-38.061874 46.402843-38.061874 23.081695 0 38.46301 15.120372 38.46301 38.061874C321.479317 346.782098 306.098002 362.090758 283.016307 362.090758zM945.448458 606.151333c0-121.888048-123.258255-221.236753-261.683954-221.236753-146.57838 0-262.015505 99.348706-262.015505 221.236753 0 122.06508 115.437126 221.200938 262.015505 221.200938 30.66644 0 61.617359-7.609305 92.423993-15.262612l84.513836 45.786813-23.178909-76.17082C899.379213 735.776599 945.448458 674.90216 945.448458 606.151333zM598.803483 567.994292c-15.332197 0-30.807656-15.096836-30.807656-30.501688 0-15.190981 15.47546-30.477129 30.807656-30.477129 23.295566 0 38.558178 15.286148 38.558178 30.477129C637.361661 552.897456 622.099049 567.994292 598.803483 567.994292zM768.25071 567.994292c-15.213493 0-30.594809-15.096836-30.594809-30.501688 0-15.190981 15.381315-30.477129 30.594809-30.477129 23.107277 0 38.558178 15.286148 38.558178 30.477129C806.808888 552.897456 791.357987 567.994292 768.25071 567.994292z"
                                        fill="#5D5D5D" p-id="4285"></path>
                                </svg>
                                <p>微信扫一扫关注</p>
                                <p>"快速预约挂号"</p>
                            </div>
                            <div class="item">
                                <img src="../../assets/images/code_app.png" alt="#" />
                                <svg t="1713257181650" class="icon" viewBox="0 0 1024 1024" version="1.1"
                                    xmlns="http://www.w3.org/2000/svg" p-id="4284" width="16" height="16">
                                    <path
                                        d="M664.250054 368.541681c10.015098 0 19.892049 0.732687 29.67281 1.795902-26.647917-122.810047-159.358451-214.077703-310.826188-214.077703-169.353083 0-308.085774 114.232694-308.085774 259.274068 0 83.708494 46.165436 152.460344 123.281791 205.78483l-30.80868 91.730191 107.688651-53.455469c38.558178 7.53665 69.459978 15.308661 107.924012 15.308661 9.66308 0 19.230993-0.470721 28.752858-1.225921-6.025227-20.36584-9.521864-41.723264-9.521864-63.862493C402.328693 476.632491 517.908058 368.541681 664.250054 368.541681zM498.62897 285.87389c23.200398 0 38.557154 15.120372 38.557154 38.061874 0 22.846334-15.356756 38.156018-38.557154 38.156018-23.107277 0-46.260603-15.309684-46.260603-38.156018C452.368366 300.994262 475.522716 285.87389 498.62897 285.87389zM283.016307 362.090758c-23.107277 0-46.402843-15.309684-46.402843-38.156018 0-22.941502 23.295566-38.061874 46.402843-38.061874 23.081695 0 38.46301 15.120372 38.46301 38.061874C321.479317 346.782098 306.098002 362.090758 283.016307 362.090758zM945.448458 606.151333c0-121.888048-123.258255-221.236753-261.683954-221.236753-146.57838 0-262.015505 99.348706-262.015505 221.236753 0 122.06508 115.437126 221.200938 262.015505 221.200938 30.66644 0 61.617359-7.609305 92.423993-15.262612l84.513836 45.786813-23.178909-76.17082C899.379213 735.776599 945.448458 674.90216 945.448458 606.151333zM598.803483 567.994292c-15.332197 0-30.807656-15.096836-30.807656-30.501688 0-15.190981 15.47546-30.477129 30.807656-30.477129 23.295566 0 38.558178 15.286148 38.558178 30.477129C637.361661 552.897456 622.099049 567.994292 598.803483 567.994292zM768.25071 567.994292c-15.213493 0-30.594809-15.096836-30.594809-30.501688 0-15.190981 15.381315-30.477129 30.594809-30.477129 23.107277 0 38.558178 15.286148 38.558178 30.477129C806.808888 552.897456 791.357987 567.994292 768.25071 567.994292z"
                                        fill="#5D5D5D" p-id="4285"></path>
                                </svg>
                                <p>微信扫一扫关注</p>
                                <p>"快速预约挂号"</p>
                            </div>
                        </div>
                    </div>
                    <p class="tip">XXX官方指定平台</p>
                    <p class="tip">快速挂号，安全放心</p>
                </el-col>
            </el-row>
            <template #footer>
                <el-button type="primary" size="default" @click="closeDialog">
                    关闭窗口
                </el-button>
            </template>
        </el-dialog>
    </div>
</template>

    <script setup lang="ts">
    import useUserStore from '@/store/modules/use'
    import { User, Lock } from '@element-plus/icons-vue'
    import { computed, reactive, ref } from 'vue'
    import CounteDown from '../counteddown/index.vue'
    import { ElMessage } from 'element-plus'
    import { reqWxLogin } from '@/api/hospital'
    import type { WXloginResponeData } from '@/api/hospital/type'
    let userStore = useUserStore();
    let scene = ref<number>(0)
    let flag = ref<boolean>(false)
    let loginParm = reactive({
        phone: '',//手机号
        code: ''//验证码
    })
    let isPhone = computed(() => {
        const reg = /^1(3[0-9]|4[01456879]|5[0-35-9]|6[2567]|7[0-8]|8[0-9]|9[0-35-9])\d{8}$/
        return reg.test(loginParm.phone)
    })
    //为表单添加ref
    let form = ref<any>()
    const changeScene = async () => {
        scene.value = 1
        //获取微信扫码登录参数，需要携带参数，重定向到项目的哪个页面
        let redirect_url = encodeURIComponent(window.location.origin + '/wxLogin');
        let result: WXloginResponeData = await reqWxLogin(redirect_url);
        console.log(result);

        //生成二维码登录页面
        //@ts-ignore
        new WxLogin({
            self_redirect: 'true',
            id: 'login_container',
            appid: result.data.appid,
            scope: 'snsapi_login',
            redirect_uri: result.data.redirectUri,
            state: result.data.state,
            style: 'black',
            href: ''
        })
    }
    //获取异步验证码debugger     console.log('组件',result);
    //定义响应数据倒计时控制
    const getCode = async () => {
        //倒计时
        flag.value = true
        try {
            await userStore.getCode(loginParm.phone)
            loginParm.code = userStore.code
        } catch (error) {
            //获取验证码失败
            //catch捕获的是Error的实例
            ElMessage({
                type: 'error',
                message: (error as Error).message
            })
        }
    }

    const getFlag = (val: boolean) => {
        flag.value = val
    }

    const Login = async () => {
        await form.value.validate();
        try {
            await userStore.userLogin(loginParm).then(() => { }, () => { });
            userStore.visiable = false;
        } catch (error) {
            ElMessage({
                type: 'error',
                message: (error as Error).message
            })
        }
    }
    //表单校验规则
    //自定义手机号码的自定义校验规则
    const validatorPhone = (rule: any, value: any, callback: any) => {
        //value当前输入文本内容（最常用校验
        //rule规则对象
        //callback回调函数
        const reg = /^1(3[0-9]|4[01456879]|5[0-35-9]|6[2567]|7[0-8]|8[0-9]|9[0-35-9])\d{8}$/
        if (reg.test(value)) {
            callback()
        } else {
            callback(new Error("Please enter a valid phone numberPlease enter the correct verification code"))
        }
    }
    //验证码自定义晓燕规则
    const validatorCode = (rule: any, value: any, callback: any) => {
        //value当前输入文本内容（最常用校验
        //rule规则对象
        //callback回调函数
        if ((/^\d{6}$/).test(value)) {
            callback()
        } else {
            callback(new Error("Please enter a valid phone number"))
        }
    }

    const rule = {
        //自带方法
        // phone:[
        //     {required:true,message:'手机号必须十一位',trigger:'change',min:11}
        // ],
        // code:[
        //     {required:true,message:'验证码是六位',trigger:'blur',min:6}
        // ]

        phone: [{ trigger: "change", validator: validatorPhone }],
        code: [{ trigger: 'change', validator: validatorCode }]
    }

    // const close = ()=>{
    //     Object.assign(loginParm,{phone:'',code:''})
    //     //清楚上一次校验结果
    //     form.value.resetFields()
    // }
    // //关闭窗口的调用函数
    const closeDialog = () => {
        userStore.visiable = false;
        form.value.resetFields()
    }
    //点击手机短信验证码盒子回调
    const handler = ()=>{
        scene.value =0
    }


</script>

    <script lang="ts">

    export default {
        name: 'Login'
    }
</script>

    <style scoped lang="scss">
    .login_container {
        ::v-deep(.el-dialog__body) {
            border-top: 1px solid #ccc;
            border-bottom: 1px solid#ccc;
        }

        .login {
            margin-top: 20px;
            border: 1px solid #ccc;
            padding: 20px;
            margin-bottom: 20px;
        }
        .webchat {
                .phone{
                    display: flex;
                flex-direction: column;
                align-items: center;
                justify-content: center;
                }
            }
        .bottom {
            display: flex;
            flex-direction: column;
            align-items: center;

            p {
                margin: 10px 0px;
            }
        }

        .leftcontent {
            .top {
                margin-top: 20px;
                display: flex;
                justify-content: space-around;

                .item {
                    display: flex;
                    flex-direction: column;
                    align-items: center;

                    img {
                        max-width: 100%;
                        max-height: 130px;
                    }

                    p {
                        margin: 5px 0px;
                    }

                }
            }
        }

        .tip {
            margin-top: 10px;
            text-align: center;
            font-size: 20px;
            font-weight: 900;
        }
    }
</style>